#include "entrance.h"
#include "dirWork.h"

using namespace std;

//void entrance::inputMenu()
//{
//	//предлагаем пользователю выбрать действие
//	cout << "Пожалуйста, выберите действие...\n";
//	//записываем выбор пользователя в переменную
//	char choice;
//	do
//	{
//		//просмотр содержимого дисков
//		cout << "\n1 - Работа с файлами\n";
//		//создать папку или файл
//		cout << "2 - Работа с директориями\n";
//		//выход из программы
//		cout << "0 - Выход\n";
//		//принимаем выбор пользователя
//		cin >> choice;
//		//анализируем выбор и вызываем соответсвующее действие
//		switch (choice)
//		{
//		case '1':
//			break;
//		case '2':
//			//CreateDirectory();
//			break;
//		
//		}
//	} while (choice != '0');//выход из программы
//}
